[
    {
        "body": "Программирование сегодня — это гонка разработчиков программ, стремящихся писать программы с большей и лучшей идиотоустойчивостью, и вселенной, которая пытается создать больше отборных идиотов. Пока вселенная побеждает.",
        "author": "Rick Cook"
    },
    {
        "body": "Низкоуровневый язык — это когда требуется внимание к вещам, которые никак не связаны с программами на этом языке.",
        "author": "Alan J. Perlis"
    },
    {
        "body": "Программирование на С похоже на быстрые танцы на только что отполированном полу людей с острыми бритвами в руках.",
        "author": "Waldi Ravens"
    },
    {
        "body": "Не волнуйтесь, если что-то не работает. Если бы всё работало, вас бы уволили.",
        "author": "Mosher’s Law of Software Engineering"
    },
    {
        "body": "Для меня долгое время было загадкой, как что-то очень дорогое и технологичное может быть столь бесполезным. И вскоре я осознал, что компьютер — это глупая машина, обладающая способностями выполнять невероятно умные вещи, тогда как программисты — это умные люди, у которых талант делать невероятные глупости. Короче, они нашли друг друга.",
        "author": "Bill Bryson"
    },
    {
        "body": "В хорошем дизайне добавление чего-то стоит дешевле, чем сама эта вещь.",
        "author": "Thomas C. Gale"
    },
    {
        "body": "В теории, теория и практика неразделимы. На практике это не так.",
        "author": "Yoggi Berra"
    },
    {
        "body": "Perl — это тот язык, который одинаково выглядит как до, так и после RSA шифрования.",
        "author": "Keith Bostic"
    },
    {
        "body": "Я изобрел понятие «объектно-ориентированный», и могу заявить, что не имел в виду C++.",
        "author": "Alan Kay"
    },
    {
        "body": "Иногда лучше остаться спать дома в понедельник, чем провести всю неделю в отладке написанного в понедельник кода.",
        "author": "Christopher Thompson"
    },
    {
        "body": "Измерять продуктивность программиста подсчетом строк кода — это так же, как оценивать постройку самолета по его весу.",
        "author": "Bill Gates"
    },
    {
        "body": "Отладка кода вдвое сложнее, чем его написание. Так что если вы пишете код настолько умно, насколько можете, то вы по определению недостаточно сообразительны, чтобы его отлаживать.",
        "author": "Brian W. Kernighan"
    },
    {
        "body": "Многие из вас знакомы с достоинствами программиста. Их всего три, и разумеется это: лень, нетерпеливость и гордыня.",
        "author": "Larry Wall"
    },
    {
        "body": "Большинство программ на сегодняшний день подобны египетским пирамидам из миллиона кирпичиков друг на друге и без конструктивной целостности — они просто построены грубой силой и тысячами рабов.",
        "author": "Alan Kay"
    },
    {
        "body": "Большинство хороших программистов делают свою работу не потому, что ожидают оплаты или признания, а потому что получают удовольствие от программирования.",
        "author": "Linus Torvalds"
    },
    {
        "body": "Всегда пишите код так, будто сопровождать его будет склонный к насилию психопат, который знает, где вы живете.",
        "author": "Martin Golding"
    },
    {
        "body": "Программы должны писаться для людей, которые будут их читать, а машины, которые будут эти программы исполнять — второстепенны.",
        "author": "Harold Abelson"
    },
    {
        "body": "Люди, которые думают, что ненавидят компьютеры, на самом деле ненавидят плохих программистов.",
        "author": "Larry Niven"
    },
    {
        "body": "Если вы дадите человеку программу, то займете его на один день. Если вы научите человека программировать, то займете его на всю жизнь.",
        "author": "Waseem Latif"
    },
    {
        "body": "Язык, который не меняет вашего представления о программировании, недостоин изучения.",
        "author": "Alan J. Perlis"
    },
    {
        "body": "Мы наблюдаем общество, которое все больше зависит от машин, но при этом использует их все неэффективнее.",
        "author": "Douglas Rushkoff"
    },
    {
        "body": "Иногда лучшие программы создаются на бумажке. Запрограммировать их — второстепенная вещь.",
        "author": "Max Kanat-Alexander"
    },
    {
        "body": "Отладка кода — это как охота. Охота на баги.",
        "author": "Amit Kalantri"
    },
    {
        "body": "Любой дурак сможет написать код, который поймет машина. Хорошие программисты пишут код, который сможет понять человек.",
        "author": "Martin Fowler"
    },
    {
        "body": "Программирование — это разбиение чего-то большого и невозможного на что-то маленькое и вполне реальное.",
        "author": "Jazzwant"
    },
    {
        "body": "Программисты — не математики, как бы нам этого ни хотелось.",
        "author": "Richard P. Gabriel"
    },
    {
        "body": "Программирование — это сложно. Основные правила, на которых все строится, очень просты, но по мере разработки программа сама начинает вводить свои правила и законы. Таким образом, программист строит лабиринт, в котором сам же может и потеряться.",
        "author": "Marijn Haverbeke"
    },
    {
        "body": "Функции, которые производят значения, легче комбинировать новыми способами, чем те, которые производят сайд-эффекты.",
        "author": "Marijn Haverbeke"
    },
    {
        "body": "Простота — залог надежности.",
        "author": "Edsger W. Dijkstra"
    },
    {
        "body": "Если вы хотите, чтобы код было легко и быстро писать — делайте его удобным для чтения.",
        "author": "Robert C. Martin"
    },
    {
        "body": "Если вы хорошо отлаживаете программы, значит, вы провели много времени, делая это. Я не хочу уметь хорошо отлаживать программы.",
        "author": "Michael C. Feathers"
    },
    {
        "body": "Работает? Не трогай.",
        "author": "Любой программист"
    },
    {
        "body": "При помощи C вы легко можете выстрелить себе в ногу. При помощи C++ это сделать сложнее, но если это произойдёт, вам оторвёт всю ногу целиком.",
        "author": "Bjarne Stroustrup"
    },
    {
        "body": "Последние нововведения в C++ были созданы, чтобы исправить предыдущие нововведения.",
        "author": "David Jameson"
    },
    {
        "body": "Java — это C++, из которого убрали все пистолеты, ножи и дубинки.",
        "author": "James Gosling"
    },
    {
        "body": "Если бы в Java действительно работала сборка мусора, большинство программ бы удаляли сами себя при первом же запуске.",
        "author": "Robert Sewell"
    },
    {
        "body": "Есть всего два типа языков программирования: те, на которые люди всё время ругаются, и те, которые никто не использует.",
        "author": "Bjarne Stroustrup"
    },
    {
        "body": "Плохое имя метода сродни предвыборным обещаниям политиков. Вроде о чем-то оно говорит, но если задуматься — непонятно о чем.",
        "author": "C. MacConnell"
    },
    {
        "body": "Неработающая программа обычно приносит меньше вреда, чем работающая плохо.",
        "author": "Dave Thomas"
    },
    {
        "body": "Насколько проще было бы писать программы, если бы не заказчики.",
        "author": "R. S. Martin"
    },
    {
        "body": "Молодые специалисты не умеют работать, а опытные специалисты умеют не работать.",
        "author": "Alexander Golov"
    },
    {
        "body": "Почаще задавайте себе вопрос «Что мне скрыть?» и вы удивитесь, сколько проблем проектирования растает на ваших глазах.",
        "author": "C. MacConnell"
    },
    {
        "body": "Преждевременная оптимизация — корень всех зол.",
        "author": "Donald Knuth"
    },
    {
        "body": "Чтобы написать чистый код, мы сначала пишем грязный код, а затем рефакторим его.",
        "author": "Robert Martin"
    },
    {
        "body": "Помимо математических способностей, жизненно важным качеством программиста является исключительно хорошее владение родным языком.",
        "author": "Edsger W. Dijkstra"
    },
    {
        "body": "Для каждой сложной задачи существует решение, которое является быстрым, простым и неправильным.",
        "author": "H. L. Mencken"
    },
    {
        "body": "Механизмы управления доступом в С++ обеспечивают защиту от несчастного случая, но не от мошенников.",
        "author": "Bjarne Stroustrup"
    },
    {
        "body": "Думаю, искусство программировать немногим сложнее других человеческих навыков. Программирование делает вас лучше точно так же, как вам помогают развиваться изучение иностранного языка, математики или чтение книг.",
        "author": "Jack Dorsey"
    },
    {
        "body": "Аналогично тому, как написание картины является искусством для души, так и написание программы является искусством для разума.",
        "author": "Volnik"
    },
    {
        "body": "Тестирование не позволяет обнаружить такие ошибки, как создание не того приложения.",
        "author": "Steve McConnell"
    },
    {
        "body": "Некоторые люди во время решения некой проблемы думают: «Почему бы мне не использовать регулярные выражения?». После этого у них уже две проблемы…",
        "author": "Jamie Zawinski"
    },
    {
        "body": "Я не умею делать скриншоты, потому что я обычно работаю на компьютере в текстовом режиме.",
        "author": "Richard Stallman"
    },
    {
        "body": "Ходить по воде и разрабатывать программы, следуя спецификации, очень просто… если они заморожены.",
        "author": "Edward V Berard"
    },
    {
        "body": "Я думаю, что Microsoft назвал технологию .NET для того, чтобы она не показывалась в списках директорий Unix.",
        "author": "Oktal"
    },
    {
        "body": "Учитывая текущее плачевное состояние наших программ, можно сказать, что программирование определенно всё ещё черная магия, и пока мы не можем называть его технической дисциплиной.",
        "author": "Bill Clinton"
    },
    {
        "body": "Намного легче портировать шелл, чем скрипт на шелле.",
        "author": "Larry Wall"
    },
    {
        "body": "Изучение программирования имеет такое же отношение к проектированию интерактивных систем, как обучение слепой печати к написанию стихов.",
        "author": "Ted Nelson"
    },
    {
        "body": "Сначала учите науку программирования и всю теорию. Далее выработайте свой программистский стиль. Затем забудьте всё и просто программируйте.",
        "author": "George Carrette"
    },
    {
        "body": "Трудность работы с программистом заключается в том, что вы не можете понять, что он делает, до тех пор, пока не стало слишком поздно.",
        "author": "Seymour Cray"
    },
    {
        "body": "Меня два раза спрашивали [члены Парламента]: «Скажите на милость, мистер Бэббидж, что случится, если вы введёте в машину неверные цифры? Cможем ли мы получить правильный ответ?» Я не могу себе даже представить, какая путаница в голове может привести к подобному вопросу.",
        "author": "Charles Babbage"
    },
    {
        "body": "С имеет мощь ассемблера и удобство… ассемблера.",
        "author": "Dennis Ritchie"
    },
    {
        "body": "UNIX невероятно прост, но нужно быть гением, чтобы понять эту простоту.",
        "author": "Dennis Ritchie"
    },
    {
        "body": "Нельзя доверять коду, который вы не написали полностью сами.",
        "author": "Ken Thompson"
    },
    {
        "body": "Ограничение возможностей языка с целью предотвращения программистских ошибок в лучшем случае опасно.",
        "author": "Bjarne Stroustrup"
    },
    {
        "body": "Если вы считаете, что С++ труден, попытайтесь выучить английский.",
        "author": "Bjarne Stroustrup"
    },
    {
        "body": "Что бы нового мы ни создавали, мы должны дать людям возможность переходить от старых инструментов и идей к новым.",
        "author": "Bjarne Stroustrup"
    },
    {
        "body": "Небольшие программы случайно компилируются и выполняются правильно при первой же попытке. Но если это происходит с любой не тривиальной программой, то это очень и очень подозрительно.",
        "author": "Bjarne Stroustrup"
    },
    {
        "body": "Модульность — фундаментальный аспект всех успешно работающих крупных систем.",
        "author": "Bjarne Stroustrup"
    },
    {
        "body": "Доказательство с помощью аналогий — это обман.",
        "author": "Bjarne Stroustrup"
    },
    {
        "body": "Программа, которая не тестировалась, не является рабочей.",
        "author": "Bjarne Stroustrup"
    },
    {
        "body": "Программирование — это не наука, а ремесло.",
        "author": "Richard Stallman"
    },
    {
        "body": "Люди думают, что безопасность — это существительное, что-то, что можно купить. На самом же деле безопасность — это абстрактное понятие, как счастье.",
        "author": "James Gosling"
    },
    {
        "body": "Если бы меня попросили выбрать какой-нибудь современный язык на замену Java, я бы выбрал Scala.",
        "author": "James Gosling"
    },
    {
        "body": "Проблема С++ в том, что необходимо узнать всё о нём перед тем, как начать писать на нём все что угодно.",
        "author": "Larry Wall"
    },
    {
        "body": "Дизайн языка программирования — это как прогулка по парку. Парку Юрского Периода.",
        "author": "Larry Wall"
    },
    {
        "body": "Думаю, это будет новой фичей. Только не говорите никому, что она возникла случайно.",
        "author": "Larry Wall"
    },
    {
        "body": "Тяжело улучшать код, который до этого уже улучшали много раз.",
        "author": "Larry Wall"
    },
    {
        "body": "Лень — главное достоинство программиста.",
        "author": "Larry Wall"
    },
    {
        "body": "Чтобы понять алгоритм, нужно его увидеть.",
        "author": "Donald Knuth"
    },
    {
        "body": "У меня предчувствие, что неизвестные цепочки ДНК расшифруются в копирайты и патенты.",
        "author": "Donald Knuth"
    },
    {
        "body": "Если вы наслаждаетесь используемыми инструментами, то работа будет выполнена успешно.",
        "author": "Donald Knuth"
    },
    {
        "body": "Помните, что обычно есть решение проще и быстрее того, что первым приходит вам в голову.",
        "author": "Donald Knuth"
    },
    {
        "body": "Если оптимизировать всё, что можно, то вы будете вечно несчастным.",
        "author": "Donald Knuth"
    },
    {
        "body": "Алгоритм Евклида — дед всех алгоритмов, потому что это старейший нетривиальный алгоритм, доживший до наших дней.",
        "author": "Donald Knuth"
    },
    {
        "body": "Легче изобрести будущее, чем предсказать его.",
        "author": "Alan Kay"
    },
    {
        "body": "Программированию обычно учат на примерах.",
        "author": "Niklaus Wirth"
    },
    {
        "body": "Программы становятся медленнее быстрее, чем «железо» становится быстрее.",
        "author": "Niklaus Wirth"
    },
    {
        "body": "Я называю это моей ошибкой на миллиард. Изобретение нулевого указателя (null — прим. ред.) в 1965.",
        "author": "Tony Hoare"
    },
    {
        "body": "Некоторые проблемы лучше не решать, а избегать.",
        "author": "Tony Hoare"
    },
    {
        "body": "Одно аккуратное измерение стоит тысячи мнений экспертов.",
        "author": "Grace Hopper"
    },
    {
        "body": "У людей аллергия на перемены.",
        "author": "Grace Hopper"
    },
    {
        "body": "Мы не можем перекладывать свои ошибки на используемые технологии.",
        "author": "Tim Berners-Lee"
    },
    {
        "body": "Лень — естественное состояние программиста, после которого он рождает хороший алгоритм.",
        "author": "Народное творчество"
    },
    {
        "body": "Магия перестаёт существовать после того, как вы понимаете, как она работает.",
        "author": "Tim Berners-Lee"
    },
    {
        "body": "Программирование — это как бить себя по лицу: рано или поздно ваш нос будет кровоточить.",
        "author": "Kyle Woodbury"
    },
    {
        "body": "Способ использования интеллекта важнее, чем его уровень.",
        "author": "C. MacConnell"
    },
    {
        "body": "Компьютер позволяет нам совершать ошибки гораздо быстрее, чем любые другие изобретения человечества, за исключением, пожалуй, текилы и оружия.",
        "author": "Mitch Radcliffe"
    },
    {
        "body": "640 Кб должно хватить для любых задач.",
        "author": "Bill Gates"
    },
    {
        "body": "Основная проблема программистов состоит в том, что их ошибки невозможно предугадать.",
        "author": "Seymour Cray"
    },
    {
        "body": "Два самых известных продукта, созданных в Университете Беркли — это UNIX и LSD. Это не может быть просто совпадением.",
        "author": "Jeremy S. Anderson"
    }
]